LalodeAvila369/Frdmkl25z_MicrosUAZ/MKL25Z128xxx4_ProjectSemaforos_Project02/source/MKL25Z128xxx4_ProjectSemaforos_Project02.c
//avared98@eddeav98: GitHub_<gitBranch.ignore>
//avared98@eddeav98: master_branch <Eduaro de Avila Armenta>
//avared98@eddeav98: title_gitbranch <Semáforos 2° Proyecto Microcontroladores>

#include <stdio.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "MKL25Z4.h"
#include "fsl_debug_console.h"
#include "fsl_tpm.h"

//Componentes Cruce Norte a Sur GPIOB
#define NGreen 0u
#define NYellow 1u
#define NRed 2u
#define NBlue 3u
#define NSense 2u

//Componentes Cruce Sur a Norte GPIOE
#define SGreen 20u
#define SYellow 21u
#define SRed 22u
#define SBlue 23u
#define SSense 29u

//Componentes Cruce Este a Oeste GPIOC
#define EGreen 5u
#define EYellow 4u
#define ERed 3u
#define EBlue 0u
#define ESense 7u

//Componentes Cruce Oeste a Este	(GPIOC-GPIOA)
#define WGreen 4u
#define WYellow 12u
#define WRed 4u
#define WBlue 2u
#define WSense 1u
#define PeopleSense 13u

typedef struct{
	uint16_t TIMER_MOD;
	//Componentes N-S
	uint8_t NVerde;
	uint8_t NRojo;
	uint8_t NAmarillo;
	uint8_t NAzul;
	//Componentes S-N
	uint8_t SVerde;
	uint8_t SRojo;
	uint8_t SAmarillo;
	uint8_t SAzul;
	//Componentes E-O
	uint8_t EVerde;
	uint8_t ERojo;
	uint8_t EAmarillo;
	uint8_t EAzul;
	//Componentes O-E
	uint8_t OVerde;
	uint8_t ORojo;
	uint8_t OAmarillo;
	uint8_t OAzul;
}state;

int main(void) {

  	BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();
  	BOARD_InitDebugConsole();

  	//Configuracion TPM
    tpm_config_t config;
    TPM_GetDefaultConfig(&config);
	config.prescale= kTPM_Prescale_Divide_128;
	TPM_Init(TPM0, &config);
	TPM_Init(TPM1, &config);
	TPM_Init(TPM2, &config);

	state FSM[34];
	FSM[0]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=1u, .NRojo=0u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 1u, .SRojo = 0u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 1u, .ERojo = 0u, .EAzul=0u, /*OE*/.OVerde = 0u, .OAmarillo = 1u, .ORojo = 0u, .OAzul=0u, .TIMER_MOD=2560u};		//Estado de Parpadeo Amarillo (IDLE)
	FSM[1]=(state ){/*NS*/.NVerde= 1u, .NAmarillo=0u, .NRojo=0u, .NAzul=0u, /*SN*/ .SVerde = 1u, .SAmarillo = 0u, .SRojo = 0u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*OE*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u, .TIMER_MOD=2024u};		//Estado Verde (NS-SN)/ Rojo (EO-OE) Sensado, t=7s
	FSM[2]=(state ){/*NS*/.NVerde= 1u, .NAmarillo=0u, .NRojo=0u, .NAzul=0u, /*SN*/ .SVerde = 1u, .SAmarillo = 0u, .SRojo = 0u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*OE*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u, .TIMER_MOD=2024u}; 		//Estado Verde Sin Vuelta (NS-SN) / Rojo (EO-OE), t=7s
	FSM[3]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=0u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 0u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*OE*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u}; 						//Estado Parpadeo Verde (NS-SN) / Rojo (EO-OE), t=1s
	FSM[4]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=1u, .NRojo=0u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 1u, .SRojo = 0u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*OE*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u, .TIMER_MOD=512u}; 		//Estado Amarillo (NS-SN) / Rojo (EO-OE), t=2s

	/*C  A  M  B  I  O     S  E  M  A  F  O  R  O  S        D  E       S  E  N  T  I  D  O */
	FSM[5]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 1u, .EAmarillo = 0u, .ERojo = 0u, .EAzul=0u, /*EO*/.OVerde = 1u, .OAmarillo = 0u, .ORojo = 0u, .OAzul=0u, .TIMER_MOD=2024u};		// Estado Rojo (NS-SN)/ Verde (EO-OE) Sensado, t=7s
	FSM[6]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 1u, .EAmarillo = 0u, .ERojo = 0u, .EAzul=0u, /*EO*/.OVerde = 1u, .OAmarillo = 0u, .ORojo = 0u, .OAzul=0u, .TIMER_MOD=2024u};		//Estado Rojo (NS-SN) / Verde Sin Vuelta (EO-OE), t=7s
	FSM[7]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 0u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 0u, .OAzul=0u};						//Estado Rojo (NS-SN) / Parpadeo Verde (EO-OE), t=1s
	FSM[8]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 1u, .ERojo = 0u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 1u, .ORojo = 0u, .OAzul=0u, .TIMER_MOD=512u};		//Estado ROJO (NS-SN) / Amarillo (EO-OE), t=2s

	/* A  Q  U  I     E  M  P  I  E  Z  A  N       E  S  T  A  D  O  S      C  O  N        V  U  E  L  T  A*/

	/*P A R A        N S e n s o r  ==  1  & &   S S e n s o r ==  0 */
	FSM[9]=(state ){/*NS*/.NVerde= 1u, .NAmarillo=0u, .NRojo=0u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 0u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u};						//Estado Verde NS / Verde Parpadeo SN / Rojo (EO-OE), t=1s
	FSM[10]=(state ){/*NS*/.NVerde=1u, .NAmarillo=0u, .NRojo=0u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 1u, .SRojo = 0u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u, .TIMER_MOD=512u};		//Estado Verde NS / Amarillo SN / Rojo (EO-OE), t=2s
	FSM[11]=(state ){/*NS*/.NVerde=1u, .NAmarillo=0u, .NRojo=0u, .NAzul=1u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u, .TIMER_MOD=1024u};		//Estado Verde y Vuelta NS / Rojo SN / Rojo (EO-OE), t=4s
	FSM[12]=(state ){/*NS*/.NVerde=0u, .NAmarillo=0u, .NRojo=0u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u};						//Estado Verde y Vuelta Parpadeo NS / Rojo SN / Rojo (EO-OE), t=1s
	FSM[13]=(state ){/*NS*/.NVerde=0u, .NAmarillo=1u, .NRojo=0u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u, .TIMER_MOD=512u};		//Estado Amarillo NS / Rojo SN / Rojo (EO-OE), t=2s

	/*P A R A        N S e n s o r  ==  0  & &   S S e n s o r ==  1 */
	FSM[14]=(state ){/*NS*/.NVerde=0u, .NAmarillo=0u, .NRojo=0u, .NAzul=0u, /*SN*/ .SVerde = 1u, .SAmarillo = 0u, .SRojo = 0u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u};						//Estado Verde Parpadeo NS / Verde SN / Rojo (EO-OE), t=1s
	FSM[15]=(state ){/*NS*/.NVerde=0u, .NAmarillo=1u, .NRojo=0u, .NAzul=0u, /*SN*/ .SVerde = 1u, .SAmarillo = 0u, .SRojo = 0u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u, .TIMER_MOD=512u};		//Estado Amarillo NS / Verde SN / Rojo (EO-OE), t=2s
	FSM[16]=(state ){/*NS*/.NVerde=0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 1u, .SAmarillo = 0u, .SRojo = 0u, .SAzul=1u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u, .TIMER_MOD=1024u};		//Estado Rojo NS / Verde y Vuelta SN / Rojo (EO-OE), t=4s
	FSM[17]=(state ){/*NS*/.NVerde=0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 0u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u};						//Estado Rojo NS / Verde y Vuelta Parpadeo SN / Rojo (EO-OE), t=1s
	FSM[18]=(state ){/*NS*/.NVerde=0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 1u, .SRojo = 0u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u, .TIMER_MOD=512u};		//Estado Rojo NS / Amarillo SN / Rojo (EO-OE), t=2s

	/*S  E  N  S  O  R  E  S        D  E        E  S  T  E     Y     O  E  S  T  E*/

	/*P A R A        E S e n s o r  ==  1  & &   W S e n s o r ==  0 */
	FSM[19]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 1u, .EAmarillo = 0u, .ERojo = 0u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 0u, .OAzul=0u};						//Estado Rojo (NS-SN)/ Verde EO / Verde Parpadeo OE, t=1s
	FSM[20]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 1u, .EAmarillo = 0u, .ERojo = 0u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 1u, .ORojo = 0u, .OAzul=0u, .TIMER_MOD=512u};		//Estado Verde EO / Amarillo OE / Rojo (NS-SN), t=2s
	FSM[21]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 1u, .EAmarillo = 0u, .ERojo = 0u, .EAzul=1u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u, .TIMER_MOD=1024u};		//Estado Verde y Vuelta EO / Rojo OE / Rojo (NS-SN), t=4s
	FSM[22]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 0u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u};						//Estado Verde y Vuelta Parpadeo EO / Rojo OE / Rojo (NS-SN), t=1s
	FSM[23]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 1u, .ERojo = 0u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u, .TIMER_MOD=512u};		//Estado Amarillo EO / Rojo OE / Rojo (NS-SN), t=2s

	/*P A R A        E S e n s o r  ==  0  & &   W S e n s o r ==  1 */
	FSM[24]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 0u, .EAzul=0u, /*EO*/.OVerde = 1u, .OAmarillo = 0u, .ORojo = 0u, .OAzul=0u};						//Estado Verde Parpadeo EO / Verde OE / Rojo (NS-SN), t=1s
	FSM[25]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 1u, .ERojo = 0u, .EAzul=0u, /*EO*/.OVerde = 1u, .OAmarillo = 0u, .ORojo = 0u, .OAzul=0u, .TIMER_MOD=512u}; 		//Estado Amarillo EO / Verde OE / Rojo (NS-SN), t=2s
	FSM[26]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 1u, .OAmarillo = 0u, .ORojo = 0u, .OAzul=1u, .TIMER_MOD=1024u}; 	//Estado Rojo EO / Verde y Vuelta OE / Rojo (NS-SN), t=4s
	FSM[27]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 0u, .OAzul=0u};						//Estado Rojo EO / Verde y Vuelta Parpadeo OE / Rojo (NS-SN), t=1s
	FSM[28]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 1u, .ORojo = 0u, .OAzul=0u, .TIMER_MOD=512u};		//Estado Rojo EO / Amarillo OE / Rojo (NS-SN), t=2s


	/*P A R A        N S e n s o r  ==  1  & &   S S e n s o r ==  1 */
	FSM[29]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=0u, .NAzul=1u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 0u, .SAzul=1u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u, .TIMER_MOD=1024u};		//Estado Azul (NS-SN), Rojo (EO-OE), t=4s
	FSM[30]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=0u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 0u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 1u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 1u, .OAzul=0u};						//Estado Parpadeo Azul (NS-SN), Rojo (EO-OE), t=1s

	/*P A R A        E S e n s o r  ==  1  & &   W S e n s o r ==  1 */
	FSM[31]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 0u, .EAzul=1u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 0u, .OAzul=1u, .TIMER_MOD=1024u};		//Estado Azul (EO-OE), Rojo (NS-SN), t=4s
	FSM[32]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=1u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 1u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 0u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 0u, .OAzul=0u};						//Estado Parpadeo Azul (EO-OE), Rojo (NS-SN), t=1s
	FSM[33]=(state ){/*NS*/.NVerde= 0u, .NAmarillo=0u, .NRojo=0u, .NAzul=0u, /*SN*/ .SVerde = 0u, .SAmarillo = 0u, .SRojo = 0u, .SAzul=0u,/*EO*/ .EVerde = 0u, .EAmarillo = 0u, .ERojo = 0u, .EAzul=0u, /*EO*/.OVerde = 0u, .OAmarillo = 0u, .ORojo = 0u, .OAzul=0u};						//Estado Parpadeo Azul (EO-OE), Rojo (NS-SN), t=1s




