LalodeAvila369/Frdmkl25z_MicrosUAZ/MKL25Z128xxx4_ProjectSemaforos_Project02/source/MKL25Z128xxx4_ProjectSemaforos_Project02.c
	uint8_t estado_reg=0;
	uint8_t estado=0;
	uint8_t Timer_init=0;
	uint32_t TIMER_FLAG;
	uint32_t Mask= 1u<<8u;
	uint32_t Mask2= 1u<<8u;
	uint32_t Mask_Off2 = Mask2;
	uint32_t Mask_Off = Mask;
	uint8_t NSensor;
	uint8_t SSensor;
	uint8_t ESensor;
	uint8_t WSensor;
	uint8_t NSensor_reg=1;
	uint8_t SSensor_reg=1;
	uint8_t ESensor_reg=1;
	uint8_t WSensor_reg=1;
	uint8_t People;
	uint8_t actual_state=0;

	//actual_state=estado;

	int Counter = 0;


    while(1) {
    	GPIO_WritePinOutput(GPIOB, NGreen, FSM[estado].NVerde);
    	GPIO_WritePinOutput(GPIOB, NYellow, FSM[estado].NAmarillo);
    	GPIO_WritePinOutput(GPIOB, NRed, FSM[estado].NRojo);
    	GPIO_WritePinOutput(GPIOB, NBlue, FSM[estado].NAzul);
    	GPIO_WritePinOutput(GPIOE, SGreen, FSM[estado].SVerde);
    	GPIO_WritePinOutput(GPIOE, SYellow, FSM[estado].SAmarillo);
    	GPIO_WritePinOutput(GPIOE, SRed, FSM[estado].SRojo);
    	GPIO_WritePinOutput(GPIOE, SBlue, FSM[estado].SAzul);
    	GPIO_WritePinOutput(GPIOC, EGreen, FSM[estado].EVerde);
		GPIO_WritePinOutput(GPIOC, EYellow, FSM[estado].EAmarillo);
		GPIO_WritePinOutput(GPIOC, ERed, FSM[estado].ERojo);
		GPIO_WritePinOutput(GPIOC, EBlue, FSM[estado].EAzul);
		GPIO_WritePinOutput(GPIOA, WGreen, FSM[estado].OVerde);
		GPIO_WritePinOutput(GPIOA, WYellow, FSM[estado].OAmarillo);
		GPIO_WritePinOutput(GPIOD, WRed, FSM[estado].ORojo);
		GPIO_WritePinOutput(GPIOA, WBlue, FSM[estado].OAzul);

    	NSensor=GPIO_ReadPinInput(GPIOC, NSense);
    	SSensor=GPIO_ReadPinInput(GPIOE, SSense);
    	ESensor=GPIO_ReadPinInput(GPIOC, ESense);
    	WSensor=GPIO_ReadPinInput(GPIOA, WSense);
    	People= GPIO_ReadPinInput(GPIOA, PeopleSense);

    	if(NSensor == 0){
			NSensor_reg=0;
    	}

    	if(SSensor == 0){
    		SSensor_reg=0;
    	}

    	if(ESensor == 0){
    		ESensor_reg=0;
    	}

    	if(WSensor == 0){
    		WSensor_reg=0;
    	}






    	TIMER_FLAG=TPM_GetStatusFlags(TPM0);

    	if(People==0){
    		estado=33;
    	}


    	switch(estado){
    	case 0:														//Estado de Parpadeo Amarillo (IDLE)
    		do{
				TPM_SetTimerPeriod(TPM1, 256u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOB, 1u<<1u);
				GPIO_TogglePinsOutput(GPIOE, 1u<<21u);
				GPIO_TogglePinsOutput(GPIOC, 1u<<4u);
				GPIO_TogglePinsOutput(GPIOA, 1u<<12u);
				while(!(TPM1->STATUS & Mask)){ 		//Wait
				}

				if(TPM1->STATUS & Mask){
					TPM1->STATUS &=Mask_Off;
					Counter=Counter+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}

			}while(Counter<=9);
    		Counter=0;
    		actual_state=estado;
    		estado=1;
    	break;

    	case 1:														 // Estado Verde (NS-SN)/ Rojo (EO-OE) Sensado, t=7s
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[1].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<8u);
				Timer_init=0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;

				if(NSensor_reg == 1 && SSensor_reg==1){
					estado_reg=0;
					NSensor_reg = 1;
					SSensor_reg = 1;
					estado = 2;
				}else if(NSensor_reg == 0 && SSensor_reg==1){
					NSensor_reg = 1;
					SSensor_reg = 1;
					estado = 9;
				}else if(NSensor_reg == 1 && SSensor_reg==0){
					NSensor_reg = 1;
					SSensor_reg = 1;
					estado = 14;
				}else if(NSensor_reg == 0 && SSensor_reg==0){
					estado_reg=1;
					NSensor_reg = 1;
					SSensor_reg = 1;
					estado = 3;
				}
			}
		break;

    	case 2:														//Estado Verde Sin Vuelta (NS-SN) / Rojo (EO-OE), t=7s                                      En estados 1-3, cumplimiento de 15 s Verde
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[2].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}


			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<8u);
				Timer_init=0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado=3;
			}
		break;

    	case 3:													//Estado Parpadeo Verde (NS-SN) / Rojo (EO-OE), t=1s
    		actual_state=estado;
			do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOB, 1u<<0u);
				GPIO_TogglePinsOutput(GPIOE, 1u<<20u);
				while(!(TPM1->STATUS & Mask)){ 		//Wait
				}

				if(TPM1->STATUS & Mask){
					TPM1->STATUS &=Mask_Off;
					Counter=Counter+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}

			}while(Counter<=9);
			Counter=0;
			estado=4;
    	break;

    	case 4:													//Estado Amarillo (NS-SN) / Rojo (EO-OE), t=2s												Cumplimiento de 2s de Amarillo
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[4].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}


			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<8u);
				Timer_init=0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				if(estado_reg==0){
					estado=5;
				}else if(estado_reg==1){
					estado=29;
				}

			}
    	break;

    	/*C  A  M  B  I  O     S  E  M  A  F  O  R  O  S        D  E       S  E  N  T  I  D  O */


    	case 5:														 // Estado Rojo (NS-SN)/ Verde (EO-OE) Sensado, t=7s
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[5].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<8u);
				Timer_init=0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;

				if(ESensor_reg == 1 && WSensor_reg==1){
					estado_reg=0;
					ESensor_reg = 1;
					WSensor_reg = 1;
					estado = 6;
				}else if(ESensor_reg == 0 && WSensor_reg==1){
					ESensor_reg = 1;
					WSensor_reg = 1;
					estado = 19;
				}else if(ESensor_reg == 1 && WSensor_reg==0){
					ESensor_reg = 1;
					WSensor_reg = 1;
					estado = 24;
				}else if(WSensor_reg == 0 && ESensor_reg==0){
					ESensor_reg = 1;
					WSensor_reg = 1;
					estado_reg=1;
					estado = 7;
				}
			}
		break;

    	case 6:														//Estado Rojo (NS-SN) / Verde Sin Vuelta (EO-OE), t=7s                                      En estados 1-3, cumplimiento de 15 s Verde
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[6].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}


			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<8u);
				Timer_init=0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado=7;
			}
		break;

    	case 7:													//Estado Rojo (NS-SN) / Parpadeo Verde (EO-OE), t=1s
    		actual_state=estado;
			do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOC, 1u<<5u);
				GPIO_TogglePinsOutput(GPIOA, 1u<<4u);
				while(!(TPM1->STATUS & Mask)){ 		//Wait
				}

