LalodeAvila369/Frdmkl25z_MicrosUAZ/MKL25Z128xxx4_ProjectSemaforos_Project02/source/MKL25Z128xxx4_ProjectSemaforos_Project02.c
				if(TPM1->STATUS & Mask){
					TPM1->STATUS &=Mask_Off;
					Counter=Counter+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}

			}while(Counter<=9);
			Counter=0;
			estado=8;
    	break;

    	case 8:													//Estado ROJO (NS-SN) / Amarillo (EO-OE), t=2s												Cumplimiento de 2s de Amarillo
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[8].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}


			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<8u);
				Timer_init=0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				if(estado_reg==0){
					estado=1;
				}else if(estado_reg==1){
					estado=31;
				}
			}
    	break;


    	/* A  Q  U  I     E  M  P  I  E  Z  A  N       E  S  T  A  D  O  S      C  O  N        V  U  E  L  T  A*/


    	/*P A R A        N S e n s o r  ==  1  & &   S S e n s o r ==  0 */

    	case 9:												//Estado Verde NS / Verde Parpadeo SN / Rojo (EO-OE), t=1s
    		actual_state=estado;
    		do{
    			TPM_SetTimerPeriod(TPM1, 64u);
    			TPM_StartTimer(TPM1, kTPM_SystemClock);
    			GPIO_TogglePinsOutput(GPIOE, 1u<<20u);
    			while(!(TPM1->STATUS & Mask)){			//Wait
    			}

    			if(TPM1->STATUS & Mask){
    				TPM1->STATUS &= Mask_Off;
    				Counter=Counter+1;
    				TPM_StopTimer(TPM1);
    				TPM1->CNT=0;
    			}
    		}while(Counter<=9);
    		Counter=0;
    		estado=10;
    	break;

    	case 10:											//Estado Verde NS / Amarillo SN / Rojo (EO-OE), t=2s								S e  c u m p l e n  l o s  10 s
    		actual_state=estado;
    		if(Timer_init==0){
    			Timer_init=1;
    			TPM_SetTimerPeriod(TPM0, FSM[10].TIMER_MOD);
    			TPM_StartTimer(TPM0, kTPM_SystemClock);
    		}

    		if(TIMER_FLAG){
    			TPM_ClearStatusFlags(TPM0, 1u<<8u);
    			Timer_init= 0;
    			TPM_StopTimer(TPM0);
    			TPM0->CNT=0;
    			estado= 11;
    		}
    	break;

    	case 11:											//Estado Verde y Vuelta NS / Rojo SN / Rojo (EO-OE), t=4s
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[11].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 12;
			}
    	break;

    	case 12:											//Estado Verde y Vuelta Parpadeo NS / Rojo SN / Rojo (EO-OE), t=1s
    		actual_state=estado;
    		do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOB, 1u<<0u);
				GPIO_TogglePinsOutput(GPIOB, 1u<<3u);
				while(!(TPM1->STATUS & Mask)){			//Wait
				}

				if(TPM1->STATUS & Mask){
					TPM1->STATUS &= Mask_Off;
					Counter=Counter+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}
			}while(Counter<=9);
			Counter=0;
			estado=13;
		break;

    	case 13:											//Estado Amarillo NS / Rojo SN / Rojo (EO-OE), t=2s
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[13].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 5;
			}
    	break;


    	/*P A R A        N S e n s o r  ==  0  & &   S S e n s o r ==  1 */

    	case 14:												//Estado Verde Parpadeo NS / Verde SN / Rojo (EO-OE), t=1s
    		actual_state=estado;
    		do{
    			TPM_SetTimerPeriod(TPM1, 64u);
    			TPM_StartTimer(TPM1, kTPM_SystemClock);
    			GPIO_TogglePinsOutput(GPIOB, 1u<<0u);
    			while(!(TPM1->STATUS & Mask)){			//Wait
    			}

    			if(TPM1->STATUS & Mask){
    				TPM1->STATUS &= Mask_Off;
    				Counter=Counter+1;
    				TPM_StopTimer(TPM1);
    				TPM1->CNT=0;
    			}
    		}while(Counter<=9);
    		Counter=0;
    		estado=15;
    	break;

    	case 15:											//Estado Amarillo NS / Verde SN / Rojo (EO-OE), t=2s								S e  c u m p l e n  l o s  10 s
    		actual_state=estado;
    		if(Timer_init==0){
    			Timer_init=1;
    			TPM_SetTimerPeriod(TPM0, FSM[15].TIMER_MOD);
    			TPM_StartTimer(TPM0, kTPM_SystemClock);
    		}

    		if(TIMER_FLAG){
    			TPM_ClearStatusFlags(TPM0, 1u<<8u);
    			Timer_init= 0;
    			TPM_StopTimer(TPM0);
    			TPM0->CNT=0;
    			estado= 16;
    		}
    	break;

    	case 16:											//Estado Rojo NS / Verde y Vuelta SN / Rojo (EO-OE), t=4s
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[11].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 17;
			}
    	break;

    	case 17:											//Estado Rojo NS / Verde y Vuelta Parpadeo SN / Rojo (EO-OE), t=1s
    		actual_state=estado;
    		do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOE, 1u<<20u);
				GPIO_TogglePinsOutput(GPIOE, 1u<<23u);
				while(!(TPM1->STATUS & Mask)){			//Wait
				}

				if(TPM1->STATUS & Mask){
					TPM1->STATUS &= Mask_Off;
					Counter=Counter+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}
			}while(Counter<=9);
			Counter=0;
			estado=18;
		break;

    	case 18:											//Estado Rojo NS / Amarillo SN / Rojo (EO-OE), t=2s
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[18].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 5;
			}
    	break;


    	/*S  E  N  S  O  R  E  S        D  E        E  S  T  E     Y     O  E  S  T  E*/


    	/*P A R A        E S e n s o r  ==  1  & &   W S e n s o r ==  0 */

    	case 19:												//Estado Rojo (NS-SN)/ Verde EO / Verde Parpadeo OE, t=1s
    		actual_state=estado;
    		do{
    			TPM_SetTimerPeriod(TPM1, 64u);
    			TPM_StartTimer(TPM1, kTPM_SystemClock);
    			GPIO_TogglePinsOutput(GPIOA, 1u<<4u);
    			while(!(TPM1->STATUS & Mask)){			//Wait
    			}

