LalodeAvila369/Frdmkl25z_MicrosUAZ/MKL25Z128xxx4_ProjectSemaforos_Project02/source/MKL25Z128xxx4_ProjectSemaforos_Project02.c
    			if(TPM1->STATUS & Mask){
    				TPM1->STATUS &= Mask_Off;
    				Counter=Counter+1;
    				TPM_StopTimer(TPM1);
    				TPM1->CNT=0;
    			}
    		}while(Counter<=9);
    		Counter=0;
    		estado=20;
    	break;

    	case 20:											//Estado Verde EO / Amarillo OE / Rojo (NS-SN), t=2s								S e  c u m p l e n  l o s  10 s
    		actual_state=estado;
    		if(Timer_init==0){
    			Timer_init=1;
    			TPM_SetTimerPeriod(TPM0, FSM[20].TIMER_MOD);
    			TPM_StartTimer(TPM0, kTPM_SystemClock);
    		}

    		if(TIMER_FLAG){
    			TPM_ClearStatusFlags(TPM0, 1u<<8u);
    			Timer_init= 0;
    			TPM_StopTimer(TPM0);
    			TPM0->CNT=0;
    			estado= 21;
    		}
    	break;

    	case 21:											//Estado Verde y Vuelta EO / Rojo OE / Rojo (NS-SN), t=4s
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[21].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 22;
			}
    	break;

    	case 22:											//Estado Verde y Vuelta Parpadeo EO / Rojo OE / Rojo (NS-SN), t=1s
    		actual_state=estado;
    		do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOC, 1u<<5u);
				GPIO_TogglePinsOutput(GPIOC, 1u<<0u);
				while(!(TPM1->STATUS & Mask)){			//Wait
				}

				if(TPM1->STATUS & Mask){
					TPM1->STATUS &= Mask_Off;
					Counter=Counter+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}
			}while(Counter<=9);
			Counter=0;
			estado=23;
		break;

    	case 23:											//Estado Amarillo EO / Rojo OE / Rojo (NS-SN), t=2s
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[23].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 1;
			}
    	break;


    	/*P A R A        E S e n s o r  ==  0  & &   W S e n s o r ==  1 */

    	case 24:												//Estado Verde Parpadeo EO / Verde OE / Rojo (NS-SN), t=1s
    		actual_state=estado;
    		do{
    			TPM_SetTimerPeriod(TPM1, 64u);
    			TPM_StartTimer(TPM1, kTPM_SystemClock);
    			GPIO_TogglePinsOutput(GPIOC, 1u<<5u);
    			while(!(TPM1->STATUS & Mask)){			//Wait
    			}

    			if(TPM1->STATUS & Mask){
    				TPM1->STATUS &= Mask_Off;
    				Counter=Counter+1;
    				TPM_StopTimer(TPM1);
    				TPM1->CNT=0;
    			}
    		}while(Counter<=9);
    		Counter=0;
    		estado=25;
    	break;

    	case 25:											//Estado Amarillo EO / Verde OE / Rojo (NS-SN), t=2s								S e  c u m p l e n  l o s  10 s
    		actual_state=estado;
    		if(Timer_init==0){
    			Timer_init=1;
    			TPM_SetTimerPeriod(TPM0, FSM[25].TIMER_MOD);
    			TPM_StartTimer(TPM0, kTPM_SystemClock);
    		}

    		if(TIMER_FLAG){
    			TPM_ClearStatusFlags(TPM0, 1u<<8u);
    			Timer_init= 0;
    			TPM_StopTimer(TPM0);
    			TPM0->CNT=0;
    			estado= 26;
    		}
    	break;

    	case 26:											//Estado Rojo EO / Verde y Vuelta OE / Rojo (NS-SN), t=4s
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[16].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 27;
			}
    	break;

    	case 27:											//Estado Rojo EO / Verde y Vuelta Parpadeo OE / Rojo (NS-SN), t=1s
    		actual_state=estado;
    		do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOA, 1u<<4u);
				GPIO_TogglePinsOutput(GPIOA, 1u<<2u);
				while(!(TPM1->STATUS & Mask)){			//Wait
				}

				if(TPM1->STATUS & Mask){
					TPM1->STATUS &= Mask_Off;
					Counter=Counter+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}
			}while(Counter<=9);
			Counter=0;
			estado=28;
		break;

    	case 28:											//Estado Rojo EO / Amarillo OE / Rojo (NS-SN), t=2s
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[28].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 1;
			}
    	break;

    	/*P A R A        N S e n s o r  ==  1  & &   S S e n s o r ==  1 */

    	case 29:											//Estado Azul (NS-SN), Rojo (NS-SN-EO-OE), t=4s
    		actual_state=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[29].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 30;
			}
    	break;

    	case 30:										//Estado Parpadeo Azul (NS-SN), Rojo (NS-SN-EO-OE), t=1s
    		actual_state=estado;
    		do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOB, 1u<<3u);
				GPIO_TogglePinsOutput(GPIOE, 1u<<23u);
				while(!(TPM1->STATUS & Mask)){			//Wait
				}

				if(TPM1->STATUS & Mask){
					TPM1->STATUS &= Mask_Off;
					Counter=Counter+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}
			}while(Counter<=9);
			Counter=0;
			estado_reg=0;
			estado=4;
    	break;



		/*P A R A        E S e n s o r  ==  1  & &   W S e n s o r ==  1 */


    	case 31:											//Estado Azul (EO-OE), Rojo (NS-SN-EO-OE), t=4s
    		actual_state=estado;
			if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[31].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(TIMER_FLAG){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 32;
			}
		break;

		case 32:										//Estado Parpadeo Azul (EO-OE), Rojo (NS-SN-EO-OE), t=1s
			actual_state=estado;
			do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOC, 1u<<0u);
				GPIO_TogglePinsOutput(GPIOA, 1u<<2u);
				while(!(TPM1->STATUS & Mask)){			//Wait
				}

