LalodeAvila369/Frdmkl25z_MicrosUAZ/MKL25Z128xxx4_ProjectSemaforos_Project02/source/MKL25Z128xxx4_ProjectSemaforos_Project02.c
				if(TPM1->STATUS & Mask){
					TPM1->STATUS &= Mask_Off;
					Counter=Counter+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}
			}while(Counter<=9);
			Counter=0;
			estado_reg=0;
			estado=8;
		break;



    	case 33:
    		GPIO_WritePinOutput(GPIOB, NGreen, FSM[estado].NVerde);
			GPIO_WritePinOutput(GPIOB, NYellow, FSM[estado].NAmarillo);
			GPIO_WritePinOutput(GPIOB, NRed, FSM[estado].NRojo);
			GPIO_WritePinOutput(GPIOB, NBlue, FSM[estado].NAzul);
			GPIO_WritePinOutput(GPIOE, SGreen, FSM[estado].SVerde);
			GPIO_WritePinOutput(GPIOE, SYellow, FSM[estado].SAmarillo);
			GPIO_WritePinOutput(GPIOE, SRed, FSM[estado].SRojo);
			GPIO_WritePinOutput(GPIOE, SBlue, FSM[estado].SAzul);
			GPIO_WritePinOutput(GPIOC, EGreen, FSM[estado].EVerde);
			GPIO_WritePinOutput(GPIOC, EYellow, FSM[estado].EAmarillo);
			GPIO_WritePinOutput(GPIOC, ERed, FSM[estado].ERojo);
			GPIO_WritePinOutput(GPIOC, EBlue, FSM[estado].EAzul);
			GPIO_WritePinOutput(GPIOA, WGreen, FSM[estado].OVerde);
			GPIO_WritePinOutput(GPIOA, WYellow, FSM[estado].OAmarillo);
			GPIO_WritePinOutput(GPIOD, WRed, FSM[estado].ORojo);
			GPIO_WritePinOutput(GPIOC, WBlue, FSM[estado].OAzul);

    		do{

    			TPM_SetTimerPeriod(TPM2, 16u);
				TPM_StartTimer(TPM2, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOB, 1u<<1u);
				GPIO_TogglePinsOutput(GPIOE, 1u<<21u);
				GPIO_TogglePinsOutput(GPIOC, 1u<<4u);
				GPIO_TogglePinsOutput(GPIOA, 1u<<12u);
				while(!(TPM2->STATUS & Mask2)){ 		//Wait
				}

				if(TPM2->STATUS & Mask2){
					TPM2->STATUS &=Mask_Off2;
					Counter=Counter+1;
					TPM_StopTimer(TPM2);
					TPM2->CNT=0;
				}

			}while(Counter<=9);
    		estado=actual_state;

    	break;

    	}
    }

}
